glcloud/keil_v5/ARM/PACK/.Web/Keil.LPC4300_DFP.pdsc
      <!-- ************************  Subfamily 'LPC43S2x'  *************************** -->
      <subFamily DsubFamily="LPC43S2x">
        <processor Pname="Cortex-M4" Dfpu="1"/>

        <feature type="USBD"          n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="MPSerial"      n="1"                           name="SSP"/>
        <feature type="PWM"           n="6"/>

        <!-- *************************  Device 'LPC4320'  ***************************** -->
        <device Dname="LPC43S20">
           <!-- RAM only device -->
          <memory id="IRAM1"                      start="0x10000000" size="0x18000"    init   ="0" default="1"/>
          <memory id="IRAM2"                      start="0x20000000" size="0x10000"    init   ="0" default="1"/>

          <book name="Documents/LPC43S50_30_20.pdf" title="LPC43S50/S30/S20 Data Sheet"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC43S3x'  *************************** -->
      <subFamily DsubFamily="LPC43S3x">
        <processor Pname="Cortex-M4" Dfpu="1"/>

        <feature type="ETH"      n="1"       m="100000000"/>
        <feature type="USBD"          n="2"/>
        <feature type="SPI"           n="1"/>
        <feature type="MPSerial"      n="1"                           name="SSP"/>
        <feature type="PWM"           n="6"/>

        <!-- *************************  Device 'LPC43S30'  ***************************** -->
        <device Dname="LPC43S30">
          <memory id="IRAM1"                      start="0x10000000"  size="0x20000"    init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>

          <book name="Documents/LPC43S50_30_20.pdf" title="LPC43S50/S30/S20 Data Sheet"/>
        </device>

        <!-- *************************  Device 'LPC43S37'  ***************************** -->
        <device Dname="LPC43S37">
          <memory id="IROM1"                             start="0x1A000000" size="0x80000"    startup="1"   default="1"/>
          <memory id="IROM2"                             start="0x1B000000" size="0x80000"    startup="0"   default="1"/>
          <memory id="IRAM1"                             start="0x10000000" size="0x08000"    init   ="0"   default="1"/>
          <memory id="IRAM2"                             start="0x20000000" size="0x10000"    init   ="0"   default="1"/>
          <algorithm name="Flash/LPC18xx43xx_512_BA.FLM" start="0x1A000000" size="0x80000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>
          <algorithm name="Flash/LPC18xx43xx_512_BB.FLM" start="0x1B000000" size="0x80000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>

          <book name="Documents/LPC43S5X_S3X.pdf" title="LPC43S5x/S3x Data Sheet"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC43S5x'  *************************** -->
      <subFamily DsubFamily="LPC43S5x">
        <processor Pname="Cortex-M4" Dfpu="1"/>

        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="USBD"          n="2"/>
        <feature type="LCD"           n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="MPSerial"      n="1"                           name="SSP"/>
        <feature type="PWM"           n="6"/>

        <!-- *************************  Device 'LPC43S50'  ***************************** -->
        <device Dname="LPC43S50">
          <memory id="IRAM1"                      start="0x10000000" size="0x20000"    init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20000000" size="0x10000"    init   ="0"   default="1"/>

          <book name="Documents/LPC43S50_30_20.pdf" title="LPC43S50/S30/S20 Data Sheet"/>
        </device>

        <!-- *************************  Device 'LPC43S57'  ***************************** -->
        <device Dname="LPC43S57">
          <memory id="IROM1"                             start="0x1A000000" size="0x80000"    startup="1"   default="1"/>
          <memory id="IROM2"                             start="0x1B000000" size="0x80000"    startup="0"   default="1"/>
          <memory id="IRAM1"                             start="0x10000000" size="0x08000"    init   ="0"   default="1"/>
          <memory id="IRAM2"                             start="0x20000000" size="0x10000"    init   ="0"   default="1"/>
          <algorithm name="Flash/LPC18xx43xx_512_BA.FLM" start="0x1A000000" size="0x80000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>
          <algorithm name="Flash/LPC18xx43xx_512_BB.FLM" start="0x1B000000" size="0x80000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>

          <book name="Documents/LPC43S5X_S3X.pdf" title="LPC43S5x/S3x Data Sheet"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC43S6x'  *************************** -->
      <subFamily DsubFamily="LPC43S6x">
        <processor Pname="Cortex-M4"                                          Dfpu="0"/>
        <processor Pname="Cortex-M0Sub" Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="204000000"/>
        <compile   Pname="Cortex-M0Sub" define="CORE_M0SUB"/>

        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="USBD"          n="2"/>
        <feature type="LCD"           n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="MPSerial"      n="1"                           name="SSP"/>
        <feature type="PWM"           n="6"/>

        <!-- *************************  Debug Description  ***************************** -->
        <debug Pname="Cortex-M0Sub" __dp="2" __ap="0" svd="SVD/LPC43xx.svd"/>

        <debugport __dp="1">
          <!-- Redefinition of Cortex-M0 DP, uses different TAP index for this sub-family -->
          <jtag tapindex="2"/>
        </debugport>
        <debugport __dp="2">
          <!-- Cortex-M0Sub DP-->
          <jtag tapindex="1"/>
        </debugport>


        <debug defaultResetSequence="ResetProcessor" Pname="Cortex-M0Sub"/>

