glcloud/keil_v5/ARM/PACK/.Web/Keil.LPC4300_DFP.pdsc
    <component Cclass="CMSIS Driver" Cgroup="SAI" Csub="I2S" Capiversion="1.0" Cversion="1.5" condition="LPC4300 CMSIS SCU GPDMA">
      <description>SAI (I2S) Driver for LPC4300 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SAI0                /* Driver SAI0 */
        #define RTE_Drivers_SAI1                /* Driver SAI1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2S_LPC43xx.c"/>
      </files>
    </component>

    <!-- MCB4300 Development Board -->
    <bundle Cbundle="MCB4300" Cclass="Board Support" Cversion="1.0.0">
      <description>Keil Development Board MCB4300</description>
      <doc>Documents/mcb1800.chm</doc>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="LPC4300 CMSIS SCU">
        <description>A/D Converter interface for Keil MCB4300 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB4300/Common/ADC_MCB4300.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="LPC4300 CMSIS SCU GPIO">
        <description>LED interface for Keil MCB4300 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB4300/Common/LED_MCB4300.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="LPC4300 CMSIS SCU GPIO">
        <description>Buttons interface for Keil MCB4300 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB4300/Common/Buttons_MCB4300.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="LPC4300 CMSIS SCU GPIO">
        <description>Joystick interface for Keil MCB4300 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB4300/Common/Joystick_MCB4300.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="LPC4300 CMSIS SCU GPIO SPI">
        <description>Graphic LCD interface for Keil MCB4300 Development Board</description>
        <files>
          <file category="header" name="Boards/Keil/MCB4300/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Keil/MCB4300/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Keil/MCB4300/Common/GLCD_MCB4300.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1" Cvariant="RGB IF" condition="LPC4300 CMSIS SCU GPIO SPI Display">
        <description>emWin LCD RGB Interface for Keil MCB4300 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB4300/Common/LCD_X.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.0" Csub="STMPE811" condition="LPC4300 CMSIS RTOS and I2C Driver">
        <description>Touchscreen interface for STMPE811</description>
        <files>
          <file category="header" name="Boards/Keil/MCB4300/Common/STMPE811.h"/>
          <file category="source" name="Boards/Keil/MCB4300/Common/Touch_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="Thermometer" Capiversion="1.0.0" Csub="LM75" condition="LPC4300 CMSIS I2C Driver">
        <description>Thermometer interface for LM75</description>
        <files>
          <file category="source" name="Boards/Keil/MCB4300/Common/Thermometer_LM75.c"/>
        </files>
      </component>
      <component Cgroup="EEPROM" Capiversion="1.0.0" Csub="24LC128" condition="LPC4300 CMSIS I2C Driver">
        <description>EEPROM interface for 24LC128</description>
        <files>
          <file category="source" name="Boards/Keil/MCB4300/Common/EEPROM_24LC128.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Capiversion="1.0.1" condition="LPC4300 CMSIS SCU GPIO SAI/I2C Driver">
        <description>Audio interface for UDA1380</description>
        <files>
          <file category="source" name="Boards/Keil/MCB4300/Common/Audio_UDA1380.c"/>
        </files>
      </component>
    </bundle>

    <!-- LPC4330-Xplorer Development Board -->
    <bundle Cbundle="LPC4330-Xplorer" Cclass="Board Support" Cversion="1.0.0">
      <description>NGX LPC4330-Xplorer Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="LPC4300 CMSIS SCU GPIO">
        <description>LED interface for NGX LPC4330-Xplorer Development Board</description>
        <files>
          <file category="source" name="Boards/NGX/LPC4330-Xplorer/Common/LED_LPC4330-Xplorer.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="LPC4300 CMSIS SCU GPIO">
        <description>Buttons interface for NGX LPC4330-Xplorer Development Board</description>
        <files>
          <file category="source" name="Boards/NGX/LPC4330-Xplorer/Common/Buttons_LPC4330-Xplorer.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Capiversion="1.0.1" condition="LPC4300 CMSIS SCU GPIO SAI/I2C Driver">
        <description>Audio interface for UDA1380</description>
        <files>
          <file category="source" name="Boards/NGX/LPC4330-Xplorer/Common/Audio_UDA1380.c"/>
        </files>
      </component>
    </bundle>
  </components>
</package>
